{
  "jokes": [
    {
      "title": "Password",
      "content": "A husband and wife are trying to set up a new password for their computer. \nThe husband puts, \"Mypenis,\" and the wife falls on the ground laughing \nbecause on the screen it says, \n\"Error. Not long enough.\""
    },
    {
      "title": "Teacher",
      "content": "Teacher: \"Kids,what does the chicken give you?\"\nStudent: \"Meat!\"\nTeacher: \"Very good! Now what does the pig give you?\"\nStudent: \"Bacon!\"\nTeacher: \"Great! And what does the fat cow give you?\"\nStudent: \"Homework!\""
    },
    {
      "title": "Taxi driver",
      "content": "A taxi passenger taps the driver on the shoulder to ask him a question. The driver screams, loses control of the car, nearly hits a bus, goes up on the footpath, and stops centimeters from a shop window. For a second, everything goes quiet in the cab, then the driver says, \"Look mate, don't ever do that again. You scared the daylights out of me!\" The passenger apologizes and says, \"I didn't realize that a little tap would scare you so much.” The driver replies, \"Sorry, it's not really your fault. Today is my first day as a cab driver. I've been driving a funeral van for the last 25 years.\""
    },
    {
      "title": "Evolution",
      "content": "A child asked his father, \"How were people born?\" So his father said, \"Adam and Eve made babies, then their babies became adults and made babies, and so on.\" The child then went to his mother, asked her the same question and she told him, \"We were monkeys then we evolved to become like we are now.\" The child ran back to his father and said, \"You lied to me!\" His father replied, \"No, your mom was talking about her side of the family.\""
    },
    {
      "title": "Nuns",
      "content": "Three nuns are talking. The first nun says, \"I was cleaning in Father's room the other day and do you know what I found? A bunch of pornographic magazines.\" \"What did you do?\" the other nun asks. \"Well, of course I threw them in the trash.\" The second nun says, \"Well, I can top that. I was in Father's room putting away the laundry and I found a bunch of condoms!\" \"Oh my!\" gasp the other nuns. \"What did you do?\" they ask. \"I poked holes in all of them!\" she replies. The third nun faints."
    },
    {
      "title": "Surprise surprise",
      "content": "During lunch at work, I ate 3 plates of beans (which I know I shouldn't). When I got home, my husband seemed excited to see me and exclaimed delightedly, \"Darling I have a surprise for dinner tonight.\" He then blindfolded me and led me to my chair at the dinner table. I took a seat and just as he was about to remove my blindfold, the telephone rang. He made me promise not to touch the blindfold until he returned and went to answer the call. The beans I had consumed were still affecting me and the pressure was becoming unbearable, so while my husband was out of the room I seized the opportunity, shifted my weight to one leg and let one go. It was not only loud, but it smelled like a fertilizer truck running over a skunk in front of a garbage dump! I took my napkin from my lap and fanned the air around me vigorously. Then, shifting to the other leg, I ripped off three more. The stink was worse than cooked cabbage. Keeping my ears carefully tuned to the conversation in the other room, I went on releasing atomic bombs like this for another few minutes. The pleasure was indescribable! Eventually the telephone farewells signaled the end of my freedom, so I quickly fanned the air a few more times with my napkin, placed it on my lap and folded my hands back on it feeling very relieved and pleased with myself. My face must have been the picture of innocence when my husband returned, apologizing for taking so long. He asked me if I had peaked through the blindfold, and I assured him I had not. At this point, he removed the blindfold, and twelve dinner guests seated around the table, with their hands to their noses, chorused, \"Happy Birthday!\""
    }
  ]
}